# YOLOv11-detect: SPD-Backbone + Split-Head (No DySample)
# Task: Object Detection (Bounding Box Only)
# Strategy: 
# 1. Backbone: SPD-Conv (Focus) to preserve pixels (Max Recall).
# 2. Head: Split-LSK-Triplet for precision.
# 3. Upsample: Standard 'nn.Upsample' (Stable).

# Parameters
nc: 4 # Number of classes (Crack)
scales:
  n: [0.50, 0.25, 1024]

# Backbone (Full SPD Integration - The Recall Booster)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2 (Stem)

  # === SPD 1 ===
  - [-1, 1, Focus, [128, 1]]               # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2

  # === SPD 2 ===
  - [-1, 1, Focus, [256, 1]]               # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4

  # === SPD 3 ===
  - [-1, 1, Focus, [512, 1]]               # 5-P4/16
  - [-1, 2, C3k2, [512, True]]             # 6

  # === SPD 4 ===
  - [-1, 1, Focus, [1024, 1]]              # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  
  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 2, C2PSA, [1024]]                 # 10

# Head (Standard Upsample + Split-LSK + Detect Head)
head:
  # === Reverted to Standard Upsample (Stable) ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11

  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 13

  # === Reverted to Standard Upsample (Stable) ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14

  - [[-1, 4], 1, Concat, [1]]
  
  # === P3 Head (Split-LSK) ===
  - [-1, 2, C3k2_LSK_Triplet_Split, [256, False]] # 16

  # === NECK SPD ===
  - [-1, 1, Focus, [256, 1]]           # 17 (Replaces Conv)

  - [[-1, 13], 1, Concat, [1]]
  
  # === P4 Head (Split-LSK) ===
  - [-1, 2, C3k2_LSK_Triplet_Split, [512, False]] # 19

  # === NECK SPD ===
  - [-1, 1, Focus, [512, 1]]           # 20 (Replaces Conv)

  - [[-1, 10], 1, Concat, [1]]
  
  # === P5 Head (Split-LSK) ===
  - [-1, 2, C3k2_LSK_Triplet_Split, [1024, True]]  # 22

  # === DETECT HEAD ===
  # Replaces Segment head.
  - [[16, 19, 22], 1, Detect, [nc]] # 23
