# YOLOv11-seg: DySample (Channel-Fix)
nc: 1
scales:
  n: [0.50, 0.25, 1024]

# Backbone (Standard + SPD for Recall)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0
  - [-1, 1, Focus, [128, 1]]               # 1
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Focus, [256, 1]]               # 3
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4
  - [-1, 1, Focus, [512, 1]]               # 5
  - [-1, 2, C3k2, [512, True]]             # 6
  - [-1, 1, Focus, [1024, 1]]              # 7
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 2, C2PSA, [1024]]                 # 10

# Head (DySample with Channel Tricks)
head:
  # === DySample P5->P4 ===
  # Arg [1024] * 0.25 = 256. 
  # Matches P5 channels. Parser is happy.
  # Code ignores 1024 and uses Scale=2. Code is happy.
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]         # 11

  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]         # 13

  # === DySample P4->P3 ===
  # Arg [512] * 0.25 = 128.
  # Matches P4 channels. Parser is happy.
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]            # 14

  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2_LSK_Triplet_Split, [256, False]] # 16

  - [-1, 1, Focus, [256, 1]]            # 17
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2_LSK_Triplet_Split, [512, False]] # 19

  - [-1, 1, Focus, [512, 1]]            # 20
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2_LSK_Triplet_Split, [1024, True]] # 22

  - [[16, 19, 22], 1, Segment, [nc, 32, 256]] # 23
