# YOLOv11-seg: GhostConv-Backbone + SPD-Neck + Split-Head + Full Channels
# Strategy:
# 1. Backbone: GhostConv for downsampling (Efficiency) + Standard C3k2 (Quality)
# 2. Neck: Focus/SPD for downsampling (Recall Preservation)
# 3. Head: Full 1024-channel LSK-Triplet (Max Representation Power)

# Parameters
nc: 1
scales:
  n: [0.50, 0.25, 1024]

# Backbone
backbone:
  # Stem (Keep standard for raw input quality)
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2

  # === GHOST 1: Downsample ===
  - [-1, 1, GhostConv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2 (Standard)

  # === GHOST 2: Downsample ===
  - [-1, 1, GhostConv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4 (Standard)

  # === GHOST 3: Downsample ===
  - [-1, 1, GhostConv, [512, 3, 2]]        # 5-P4/16
  - [-1, 2, C3k2, [512, True]]             # 6 (Standard)

  # === GHOST 4: Downsample ===
  - [-1, 1, GhostConv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8 (Standard)

  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 2, C2PSA, [1024]]                 # 10

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]

  # P3 Smart Exit
  - [-1, 2, C3k2, [256, False]] # 16

  # === SPD-CONV (Focus) Downsample ===
  # Preserves fine cracks when moving P3 -> P4
  - [-1, 1, Focus, [256, 1]]                    # 17

  - [[-1, 13], 1, Concat, [1]]

  # P4 Smart Exit
  - [-1, 2, C3k2, [512, False]] # 19

  # === SPD-CONV (Focus) Downsample ===
  # Preserves fine cracks when moving P4 -> P5
  - [-1, 1, Focus, [512, 1]]                    # 20

  - [[-1, 10], 1, Concat, [1]]

  # P5 Smart Exit (FULL 1024 CHANNELS)
  # Restored to max capacity to prove efficiency
  - [-1, 2, C3k2, [1024, True]]  # 22

  - [[16, 19, 22], 1, Segment, [nc, 32, 256]] # 23
