# YOLOv11-seg: Full-SPD Recall Specialist (FIXED)
# Fix: Removed 'nn.' prefix from DySample calls.

# Parameters
nc: 1
scales:
  n: [0.50, 0.25, 1024]

# Backbone (Full SPD Integration)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 1]]               # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 1]]               # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4
  - [-1, 1, Focus, [512, 1]]               # 5-P4/16
  - [-1, 2, C3k2, [512, True]]             # 6
  - [-1, 1, Focus, [1024, 1]]              # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 2, C2PSA, [1024]]                 # 10

# Head (Split-LSK + SPD Neck + DySample Upsample)
head:
  # === DySample 1 (P5 -> P4) ===
  # FIXED: Removed 'nn.' prefix. Just 'DySample'.
  - [-1, 1, DySample, [2]]              # 11
  - [[-1, 6], 1, Concat, [1]]
  
  - [-1, 2, C3k2, [512, False]] # 13

  # === DySample 2 (P4 -> P3) ===
  # FIXED: Removed 'nn.' prefix.
  - [-1, 1, DySample, [2]]              # 14
  - [[-1, 4], 1, Concat, [1]]
  
  # === P3 Head (Split-LSK) ===
  - [-1, 2, C3k2_LSK_Triplet_Split, [256, False]] # 16

  # === NECK SPD ===
  - [-1, 1, Focus, [256, 1]]           # 17 (Replaces Conv)
  - [[-1, 13], 1, Concat, [1]]
  
  # === P4 Head (Split-LSK) ===
  - [-1, 2, C3k2_LSK_Triplet_Split, [512, False]] # 19

  # === NECK SPD ===
  - [-1, 1, Focus, [512, 1]]           # 20 (Replaces Conv)
  - [[-1, 10], 1, Concat, [1]]
  
  # === P5 Head (Split-LSK) ===
  - [-1, 2, C3k2_LSK_Triplet_Split, [1024, True]]  # 22
  - [[16, 19, 22], 1, Segment, [nc, 32, 256]] # 23
