# YOLOv11-seg: SPD+DySample Recall Specialist (Fixed Dimensions)
# Ensures all spatial dimensions align correctly
# No extra Convs after Focus/DySample to save parameters

nc: 1
scales:
  n: [0.50, 0.25, 1024]

# ========================================
# BACKBONE: Conv early, Focus later
# ========================================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2: 640→320
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4: 320→160
  - [-1, 2, C3k2, [128, False, 0.25]]      # 2: 160×160×128
  
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8: 160→80
  - [-1, 2, C3k2, [256, False, 0.25]]      # 4: 80×80×256
  
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16: 80→40
  - [-1, 2, C3k2, [512, True]]             # 6: 40×40×512
  
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32: 40→20
  - [-1, 2, C3k2, [1024, True]]            # 8: 20×20×1024
  
  - [-1, 1, SPPF, [1024, 5]]               # 9: 20×20×1024
  - [-1, 2, C2PSA, [1024]]                 # 10: 20×20×1024

# ========================================
# HEAD: DySample UP + Focus DOWN
# ========================================
head:
  # === P5 -> P4 (DySample UP) ===
  - [-1, 1, DySample, [2]]                          # 11: 20×20 → 40×40 (1024ch)
  - [[-1, 6], 1, Concat, [1]]                       # 12: (40×40×1024) + (40×40×512) = 1536ch
  - [-1, 2, C3k2, [512, False]]                     # 13: 40×40×512
  
  # === P4 -> P3 (DySample UP) ===
  - [-1, 1, DySample, [2]]                          # 14: 40×40 → 80×80 (512ch)
  - [[-1, 4], 1, Concat, [1]]                       # 15: (80×80×512) + (80×80×256) = 768ch
  - [-1, 2, C3k2, [256, False]]                     # 16: 80×80×256 (P3 output)
  
  # === P3 -> P4 (Focus DOWN) ===
  - [-1, 1, Conv, [256, 3, 2]]                       # 17: 80×80 → 40×40 (256→1024ch after Focus)
  - [[-1, 13], 1, Concat, [1]]                      # 18: (40×40×1024) + (40×40×512) = 1536ch
  - [-1, 2, C3k2, [512, False]]                     # 19: 40×40×512 (P4 output)
  
  # === P4 -> P5 (Focus DOWN) ===
  - [-1, 1, Conv, [512, 3, 2]]                     # 20: 40×40 → 20×20 (512→2048ch after Focus)
  - [[-1, 10], 1, Concat, [1]]                      # 21: (20×20×2048) + (20×20×1024) = 3072ch
  - [-1, 2, C3k2, [1024, True]]                     # 22: 20×20×1024 (P5 output)
  
  # === Segment Head ===
  - [[16, 19, 22], 1, Segment, [nc, 32, 256]]       # 23: Detect P3, P4, P5
