# YOLOv11-seg: DySample Upsampling Only (Simplified)
# Conv for all downsampling, DySample for upsampling
# Maximum compatibility

nc: 1
scales:
  n: [0.50, 0.25, 1024]

# ========================================
# BACKBONE: Standard Conv downsampling
# ========================================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2: 640→320
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4: 320→160
  - [-1, 2, C3k2, [128, False, 0.25]]      # 2: 160×160
  
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8: 160→80
  - [-1, 2, C3k2, [256, False, 0.25]]      # 4: 80×80 (P3)
  
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16: 80→40
  - [-1, 2, C3k2, [512, True]]             # 6: 40×40 (P4)
  
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32: 40→20
  - [-1, 2, C3k2, [1024, True]]            # 8: 20×20
  
  - [-1, 1, SPPF, [1024, 5]]               # 9: 20×20
  - [-1, 2, C2PSA, [1024]]                 # 10: 20×20 (P5)

# ========================================
# HEAD: DySample UP + Conv DOWN
# ========================================
head:
  # === P5 -> P4 (DySample UP) ===
  - [-1, 1, DySample, []]                 # 11: 20×20 → 40×40
  - [[-1, 6], 1, Concat, [1]]                       # 12: concat with P4
  - [-1, 2, C3k2, [512, False]]                     # 13: 40×40 (P4)
  
  # === P4 -> P3 (DySample UP) ===
  - [-1, 1, DySample, []]                 # 14: 40×40 → 80×80
  - [[-1, 4], 1, Concat, [1]]                       # 15: concat with P3
  - [-1, 2, C3k2, [256, False]]                     # 16: 80×80 (P3)
  
  # === P3 -> P4 (Conv DOWN) ===
  - [-1, 1, Conv, [256, 3, 2]]                      # 17: 80×80 → 40×40
  - [[-1, 13], 1, Concat, [1]]                      # 18: concat
  - [-1, 2, C3k2, [512, False]]                     # 19: 40×40 (P4)
  
  # === P4 -> P5 (Conv DOWN) ===
  - [-1, 1, Conv, [512, 3, 2]]                      # 20: 40×40 → 20×20
  - [[-1, 10], 1, Concat, [1]]                      # 21: concat
  - [-1, 2, C3k2, [1024, True]]                     # 22: 20×20 (P5)
  
  # === Segment Head ===
  - [[16, 19, 22], 1, Segment, [nc, 32, 256]]       # 23
