# YOLOv11-seg with Optimal LSK Placement for Crack Segmentation
# Based on architecture analysis: Layer 13 (P4 neck) is the sweet spot

# Parameters
nc: 1  # Single class: crack
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone - Standard feature extraction
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 2, C3k2, [512, True]]             # 6
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 2, C2PSA, [1024]]                 # 10

# Head - LSK at optimal fusion points
head:
  # Top-down pathway
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 11
  - [[-1, 6], 1, Concat, [1]]                       # 12 - P4 fusion
  - [-1, 2, C3k2_LSK, [512, False]]                 # 13 - ⭐ MAIN LSK (30×40 resolution)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 14
  - [[-1, 4], 1, Concat, [1]]                       # 15 - P3 fusion
  - [-1, 2, C3k2_LSK, [256, False]]                 # 16 - 🔥 SECONDARY LSK (60×80 resolution)

  # Bottom-up pathway
  - [-1, 1, Conv, [256, 3, 2]]                      # 17
  - [[-1, 13], 1, Concat, [1]]                      # 18 - P4 concat
  - [-1, 2, C3k2, [512, False]]                     # 19

  - [-1, 1, Conv, [512, 3, 2]]                      # 20
  - [[-1, 10], 1, Concat, [1]]                      # 21 - P5 concat
  - [-1, 2, C3k2, [1024, True]]                     # 22

  - [[16, 19, 22], 1, Segment, [nc, 32, 256]]       # 23 - Segmentation head

# Justification:
# - Layer 13 (P4): Optimal resolution (30×40) for crack continuity
# - Layer 16 (P3): High resolution (60×80) for fine boundaries
# - Multi-scale LSK attention captures both detail and context
# - Total LSK modules: 2 (balanced performance vs. computation)
