# YOLOv11-seg: Ghost-Backbone + LSK-Neck (Optimized without P2)
# Target: ~2.8M Parameters | Focused on P3, P4, P5 scales

# Parameters
nc: 1  # Single class: crack
scales:
  n: [0.50, 0.25, 1024] # Nano scale

# Backbone - Ghost Implementation (Lightweight Feature Extraction)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 2, C3k2_Ghost, [256, False, 0.5]] # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 2, C3k2_Ghost, [512, False, 0.5]] # 4
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 2, C3k2_Ghost, [512, True]]       # 6
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 2, C3k2_Ghost, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 2, C2PSA, [1024]]                 # 10

# Head - LSK at optimal fusion points
head:
  # Top-down pathway
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 11
  - [[-1, 6], 1, Concat, [1]]                       # 12 - P4 fusion
  - [-1, 2, C3k2, [512, False]]                     # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 14
  - [[-1, 4], 1, Concat, [1]]                       # 15 - P3 fusion
  - [-1, 2, C3k2_LSK, [256, False, 1]]              # 16 - P3 LSK (dilation=1)

  # Bottom-up pathway - FIXED: Changed Layer 17 from Upsample back to Conv
  - [-1, 1, Conv, [256, 3, 2]]                      # 17 - Downsample to match P4 spatial size
  - [[-1, 13], 1, Concat, [1]]                      # 18 - P4 concat (spatial sizes now match)
  - [-1, 2, C3k2_LSK, [512, False, 1]]              # 19 - Medium crack LSK

  - [-1, 1, Conv, [512, 3, 2]]                      # 20 - Downsample to match P5 spatial size
  - [[-1, 10], 1, Concat, [1]]                      # 21 - P5 concat
  - [-1, 2, C3k2_LSK, [512, True, 2]]              # 22 - Large crack LSK (dilation=3)

  # Segmentation Head (P3, P4, P5 scales)
  - [[16, 19, 22], 1, Segment, [nc, 32, 256]]       # 23 - Final Prediction
