# YOLOv11-seg: Ghost-Backbone + Split-Attention Neck
# Clean Version: Uses default expansion (e=0.5) for head layers
# Target: ~2.8M Parameters (Standard Nano Balance)

# Parameters
nc: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]

# Backbone (Unchanged - Efficient Ghost)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 2, C3k2_Ghost, [256, False, 0.25]] # 2 (Explicit 0.25 for early layer efficiency)
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 2, C3k2_Ghost, [512, False, 0.25]] # 4 (Explicit 0.25 for early layer efficiency)
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 2, C3k2_Ghost, [512, True]]       # 6 (Implicit 0.5)
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 2, C3k2_Ghost, [1024, True]]      # 8 (Implicit 0.5)
  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 2, C2PSA, [1024]]                 # 10

# Head (Cleaned - Implicit Defaults)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]

  # === FIX 1: P3 Layer ===
  # Removed explicit '0.25'. Now uses default e=0.5
  - [-1, 2, C3k2_LSK_Triplet_Split, [256, False]] # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]

  # === FIX 2: P4 Layer ===
  # Removed explicit '0.25'. Now uses default e=0.5
  - [-1, 2, C3k2_LSK_Triplet_Split, [512, False]] # 19

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]

  # === FIX 3: P5 Layer ===
  # Removed explicit '0.25'. Now uses default e=0.5
  - [-1, 2, C3k2_LSK_Triplet_Split, [512, True]]  # 22

  - [[16, 19, 22], 1, Segment, [nc, 32, 256]] # 23
